*** lf-noise0
#+BEGIN_SRC clojure :results output
(doc lf-noise0)
#+END_SRC

#+RESULTS:
#+begin_example
-------------------------
overtone.live/lf-noise0
([freq])
  
  [freq 500.0]

  freq - Approximate rate at which to generate 
         random values. 

  Generates random values between -1 and 1 at a rate (the 
  rate is not guaranteed but approximate) 

  Categories: Generators -> Stochastic
  Rates: [ :ar, :kr ]
  Default rate: :ar
#+end_example
*** lf-noise1
#+BEGIN_SRC clojure :results output
(doc lf-noise1)
#+END_SRC

#+RESULTS:
#+begin_example
-------------------------
overtone.live/lf-noise1
([freq])
  
  [freq 500.0]

  freq - Approximate rate at which to generate 
         random values. 

  Generates linearly interpolated random values between -1 
  and 1 at the supplied rate (the rate is not guaranteed but 
  approximate). 

  Categories: 
  Rates: [ :ar, :kr ]
  Default rate: :ar
#+end_example
*** lf-noise2
#+BEGIN_SRC clojure :results output
(doc lf-noise2)
#+END_SRC

#+RESULTS:
#+begin_example
-------------------------
overtone.live/lf-noise2
([freq])
  
  [freq 500.0]

  freq - Approximate rate at which to generate 
         random values. 

  Generates quadratically interpolated random values between 
  -1 and 1 at the supplied rate (the rate is not guaranteed 
  but approximate).

  Note: quadratic interpolation means that the noise values 
  can occasionally extend beyond the normal range of +-1, if 
  the freq varies in certain ways. If this is undesirable 
  then you might like to clip2 the values or use a 
  linearly-interpolating unit instead. 

  Categories: 
  Rates: [ :ar, :kr ]
  Default rate: :ar
#+end_example

*** lf-clip-noise
#+BEGIN_SRC clojure :results output
(doc lf-clip-noise)
#+END_SRC

#+RESULTS:
#+begin_example
-------------------------
overtone.live/lf-clip-noise
([freq])
  
  [freq 500.0]

  freq - Approximate rate at which to generate 
         random values. 

  Randomly generates the values -1 or +1 at a rate given by 
  the nearest integer division of the sample rate by the 
  freq argument. It is probably pretty hard on your 
  speakers! 

  Categories: 
  Rates: [ :ar, :kr ]
  Default rate: :ar
#+end_example

*** lfd-noise0
#+BEGIN_SRC clojure :results output
(doc lfd-noise0)
#+END_SRC

#+RESULTS:
#+begin_example
-------------------------
overtone.live/lfd-noise0
([freq])
  
  [freq 500.0]

  freq - Rate at which to generate random values. 

  Like lf-noise0, it generates random values between -1 and 
  1 at a rate given by the freq argument, with two 
  differences: p * no time quantization

  * fast recovery from low freq values.

  (lf-noise0,1,2 quantize to the nearest integer division of 
  the samplerate and they poll the freq argument only when 
  scheduled, and thus seem to hang when freqs get very 
  low).

  If you don't need very high or very low freqs, or use 
  fixed freqs lf-noise0 is more efficient. 

  Categories: 
  Rates: [ :ar, :kr ]
  Default rate: :ar
#+end_example

*** dust
#+BEGIN_SRC clojure :results output
(doc dust)
#+END_SRC

#+RESULTS:
#+begin_example
-------------------------
overtone.live/dust
([density])
  
  [density 0.0]

  density - Average number of impulses per second 

  Generates random impulses from 0 to +1. 

  Categories: Generators -> Stochastic
  Rates: [ :ar, :kr ]
  Default rate: :ar
#+end_example

*** dust2
#+BEGIN_SRC clojure :results output
(doc dust2)
#+END_SRC

#+RESULTS:
#+begin_example
-------------------------
overtone.live/dust2
([density])
  
  [density 0.0]

  density - Average number of impulses per second. 

  Generates random impulses from -1 to +1. 

  Categories: Generators -> Stochastic
  Rates: [ :ar, :kr ]
  Default rate: :ar
#+end_example

** name space (if gets messed up looking at .clj files
#+BEGIN_SRC clojure
(in-ns 'user)
#+END_SRC

#+RESULTS:
: #namespace[user]
